src/apersci/output/templates/request-createFulfillmentLocation.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v4="http://v4.core.coexprivate.api.shopatron.com">
   <soapenv:Header/>
   <soapenv:Body>
      <v4:createFulfillmentLocation>
         <v4:request>
            <v4:FulfillerID>{{.FulfillerID}}</v4:FulfillerID>
            <v4:RetailerLocationID>{{.RetailerLocationID}}</v4:RetailerLocationID>
            <v4:ExternalLocationID>{{.ExternalLocationID}}</v4:ExternalLocationID>
            <v4:LocationName>{{.LocationName}}</v4:LocationName>
            <v4:LocationType>{{.LocationType}}</v4:LocationType>
            <v4:Latitude>{{.Latitude}}</v4:Latitude>
            <v4:Longitude>{{.Longitude}}</v4:Longitude>
            <v4:Status>{{.Status}}</v4:Status>
            <v4:CountryCode>{{.CountryCode}}</v4:CountryCode>
         </v4:request>
      </v4:createFulfillmentLocation>
   </soapenv:Body>
</soapenv:Envelope>
